Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The awakened thread will compete in the usual manner with any other threads that might be actively competing to synchronize on this object; for example, the awakened thread enjoys no reliable privilege or disadvantage in being the next thread to lock this object.
zh_cn: 被唤醒的线程将以常规方式与在该对象上主动同步的其他所有线程进行竞争；例如，唤醒的线程在作为锁定此对象的下一个线程方面没有可靠的特权或劣势。

source: The awakened thread will not be able to proceed until the current thread relinquishes the lock on this object.
zh_cn: 直到当前线程放弃此对象上的锁定，才能继续执行被唤醒的线程。

source: The awakened threads will compete in the usual manner with any other threads that might be actively competing to synchronize on this object; for example, the awakened threads enjoy no reliable privilege or disadvantage in being the next thread to lock this object.
zh_cn: 被唤醒的线程将以常规方式与在该对象上主动同步的其他所有线程进行竞争；例如，唤醒的线程在作为锁定此对象的下一个线程方面没有可靠的特权或劣势。

source: The awakened threads will not be able to proceed until the current thread relinquishes the lock on this object.
zh_cn: 直到当前线程放弃此对象上的锁定，才能继续执行被唤醒的线程。

source: The base Buffer class defines these properties as well as methods for clearing, flipping, and rewinding, for marking the current position, and for resetting the position to the previous mark.
zh_cn: 基本 Buffer 类定义了这些属性以及 清除 、 反转 和 重绕 方法，用以 标记 当前位置，以及将当前位置 重置 为前一个标记处。

source: The behavior of the returned map is system-dependent.
zh_cn: 返回的映射的行为取决于系统。

source: The bin count threshold for untreeifying a (split) bin during a resize operation.
zh_cn: 用于 resize 期间对 bin 取消树化（分割）的 bin 数阈值。

source: The bin count threshold for using a tree rather than list for a bin.
zh_cn: 使用树而不是列表的 bin 数阈值。

source: The buffer is used as a repository of characters as-is: the only changes made are the results of a put operation.
zh_cn: 缓冲区可用作类似以下字符的存储库：所做的唯一改变是 put 操作的结果。

source: The capacity is the amount of storage available for newly inserted characters, beyond which an allocation will occur.
zh_cn: 容量指可用于最新插入字符的存储量，超过这一容量便需要再次分配。

source: The central abstractions of the NIO APIs are:
zh_cn: NIO API 的集中抽象为：

source: The character at index k in the new character sequence is equal to:
zh_cn: 新字符序列中索引 k 处的字符等于：

source: The character at index k in this sequence becomes equal to:
zh_cn: 在此序列中索引 k 处的字符等于：

source: The character at the specified index is set to ch.
zh_cn: 将给定索引处的字符设置为 ch。

source: The characters are copied into the subarray of dst starting at index dstBegin and ending at index:
zh_cn: 要复制到 dst 子数组的字符从索引 dstBegin 处开始，结束于以下索引：

source: The characters of the CharSequence argument are appended, in order, increasing the length of this sequence by the length of the argument.
zh_cn: 按顺序追加 CharSequence 变量中的字符，此序列将增加该变量的长度。

source: The characters of the CharSequence argument are inserted, in order, into this sequence at the indicated offset, moving up any characters originally above that position and increasing the length of this sequence by the length of the argument s.
zh_cn: 按顺序将 CharSequence 参数中的字符插入此序列中的指定位置，位于该位置处的原有字符将向后移，此序列将增加该参数的长度。

source: The characters of the String argument are appended, in order, increasing the length of this sequence by the length of the argument.
zh_cn: 按顺序追加 String 变量中的字符，此序列将增加该变量的长度。

source: The characters of the String argument are inserted, in order, into this sequence at the indicated offset, moving up any characters originally above that position and increasing the length of this sequence by the length of the argument.
zh_cn: 按顺序将 String 参数中的字符插入此序列中的指定位置，位于该位置处的原有字符将向后移，此序列将增加该参数的长度。

source: The characters of the StringBuffer argument are appended, in order, to the contents of this StringBuffer, increasing the length of this StringBuffer by the length of the argument.
zh_cn: 按顺序将 StringBuffer 参数中的字符追加到此 StringBuffer 中，并使 StringBuffer 在长度上增加该参数的长度。

source: The characters of the StringBuffer argument are appended, in order, to this sequence, increasing the length of this sequence by the length of the argument.
zh_cn: 按顺序追加 StringBuffer 参数中的字符，此序列将增加该参数的长度。

source: The characters of the array argument are appended, in order, to the contents of this sequence.
zh_cn: 按顺序将数组参数中的字符追加到此序列中。

source: The characters of the array argument are inserted into the contents of this sequence at the position indicated by offset.
zh_cn: 数组参数的字符将被插入此序列中 offset 所指示的位置处。

source: The characters of the subarray are inserted into this sequence at the position indicated by index.
zh_cn: 子数组的字符将被插入 index 所指示的位置。

source: The characters to be appended should be valid Unicode characters as described in Unicode Character Representation.
zh_cn: 要添加的字符应该是有效的 Unicode 字符，正如 Unicode Character Representation 中描述的那样。

source: The charset API is defined in the java.nio.charset package, and the channel and selector APIs are defined in the java.nio.channels package.
zh_cn: java.nio.charset 包中定义了字符集 API，java.nio.channels 包中定义了信道和选择器 API。

source: The choice is arbitrary and occurs at the discretion of the implementation.
zh_cn: 选择是任意性的，并在对实现做出决定时发生。

source: The class Date represents a specific instant in time, with millisecond precision.
zh_cn: 类 Date 表示特定的瞬间，精确到毫秒。

source: The class Exception and any subclasses that are not also subclasses of RuntimeException are checked exceptions.
zh_cn: 类 Exception 和任何子类，只要不属于 RuntimeException 的子类都是 checked exceptions (检查型异常)。

source: The class Exception and its subclasses are a form of Throwable that indicates conditions that a reasonable application might want to catch.
zh_cn: Exception 类及其子类是 Throwable 的一种形式，它指出了合理的应用程序想要捕获的条件。

source: The class Math contains methods for performing basic numeric operations such as the elementary exponential, logarithm, square root, and trigonometric functions.
zh_cn: Math 类包含用于执行基本数学运算的方法，如初等指数、对数、平方根和三角函数。

source: The class Math provides commonly used mathematical functions such as sine, cosine, and square root.
zh_cn: 类 Math 提供了常用的数学函数，比如正弦、余弦和平方根。

source: The class Object does not itself implement the interface Cloneable, so calling the clone method on an object whose class is Object will result in throwing an exception at run time.
zh_cn: Object 类本身不实现接口 Cloneable，所以在类为 Object 的对象上调用 clone 方法将会导致在运行时抛出异常。

source: The class StrictMath contains methods for performing basic numeric operations such as the elementary exponential, logarithm, square root, and trigonometric functions.
zh_cn: StrictMath 类包含用于执行基本数学运算的方法，如初等指数、对数、平方根和三角函数。

source: The class String includes methods for examining individual characters of the sequence, for comparing strings, for searching strings, for extracting substrings, and for creating a copy of a string with all characters translated to uppercase or to lowercase.
zh_cn: String 类包括的方法可用于检查序列的单个字符、比较字符串、搜索字符串、提取子字符串、创建字符串副本并将所有字符全部转换为大写或小写。

source: The class Process provides methods for performing input from the process, performing output to the process, waiting for the process to complete, checking the exit status of the process, and destroying (killing) the process.
zh_cn: Process 类提供了执行从进程输入、执行输出到进程、等待进程完成、检查进程的退出状态以及销毁（杀掉）进程的方法。

source: The class ClassLoader is an abstract class.
zh_cn: ClassLoader 类是一个抽象类。

source: The class Authenticator represents an object that knows how to obtain authentication for a network connection.
zh_cn: Authenticator 类表示懂得如何获得网络连接验证的对象。

source: The class PasswordAuthentication is a data holder that is used by Authenticator.
zh_cn: PasswordAuthentication 类是供 Authenticator 使用的数据持有者。

source: The class implements a buffered output stream.
zh_cn: 该类实现缓冲的输出流。

source: The class itself defines a programming interface to which applications may write.
zh_cn: 该类本身定义了应用程序可以写入的编程接口。

source: The class loader for an array class, as returned by getClassLoader() is the same as the class loader for its element type; if the element type is a primitive type, then the array class has no class loader.
zh_cn: 数组类的类加载器由 Class.getClassLoader() 返回，该加载器与其元素类型的类加载器是相同的；如果该元素类型是基本类型，则该数组类没有类加载器。

source: The class must define a method of no arguments called run.
zh_cn: 类必须定义一个称为 run 的无参数方法。

source: The classes String, StringBuffer, and StringBuilder similarly provide commonly used operations on character strings.
zh_cn: 类似地，类 String、StringBuffer 和 StringBuilder 提供了常用的字符串操作。

source: The classes are:
zh_cn: 这些类为：

source: The classes in this package also contain methods to get and unconditionally set values, as well as a weaker conditional atomic update operation weakCompareAndSet described below.
zh_cn: 此包中的类还包含获取并无条件设置值的方法，以及以下描述的较弱条件的原子更新操作 weakCompareAndSet。

source: The collection is backed by the map, so changes to the map are reflected in the collection, and vice-versa.
zh_cn: 该 collection 受映射的支持，所以对映射的更改将反映在该 collection 中，反之亦然。

source: The collection supports element removal, which removes the corresponding mapping from the map, via the Iterator.remove, Collection.remove, removeAll, retainAll and clear operations.
zh_cn: 该 collection 支持元素的移除，通过 Iterator.remove、Collection.remove、removeAll、retainAll 和 clear 操作可从该映射中移除相应的映射关系。

source: The common interface extended by all annotation types.
zh_cn: 所有 annotation 类型都要扩展的公共接口。

source: The concurrent-programming-like SSA-based coding style helps avoid aliasing errors amid all of the twisty pointer operations.
zh_cn: 类似于并发编程的基于 SSA 的编码风格有助于避免所有扭曲的指针操作中的别名错误。

source: The constant value of this field is the largest value of type char, '\uFFFF'.
zh_cn: 此字段的常量值是 char 类型的最大值，即 '\uFFFF'。

source: The constant value of this field is the smallest value of type char, '\u0000'.
zh_cn: 此字段的常量值是 char 类型的最小值，即 '\u0000'。

source: The constants of this enumerated type describe the various policies for retaining annotations.
zh_cn: 此枚举类型的常量描述保留注释的不同策略。

source: The constants of this enumerated type provide a simple classification of the declared elements in a Java program.
zh_cn: 此枚举类型的常量提供了 Java 程序中声明的元素的简单分类。

source: The contents all three implementation strings are vendor specific.
zh_cn: 三个实现字符串内容都是特定于供应商的。

source: The context ClassLoader is provided by the creator of the thread for use by code running in this thread when loading classes and resources.
zh_cn: 上下文 ClassLoader 由线程创建者提供，供运行于该线程中的代码在加载类和资源时使用。

source: The current runtime can be obtained from the getRuntime method.
zh_cn: 可以通过 getRuntime 方法获取当前运行时。

source: The current thread must own this object's monitor.
zh_cn: 当前线程必须拥有此对象监视器。

source: The declaring class of the Method object will be the interface that the method was declared in, which may be a superinterface of the proxy interface that the proxy class inherits the method through.
zh_cn: Method 对象的声明类将是在其中声明方法的接口，该接口可以是代理类赖以继承方法的代理接口的超接口。

source: The declaring class of the Method object passed to invoke will be java.lang.Object.
zh_cn: 传递到 invoke 的 Method 对象的声明类是 java.lang.Object。

source: The default initial capacity - MUST be a power of two.
zh_cn: 默认初始容量 - 必须是 2 的幂。

source: The default priority that is assigned to a thread.
zh_cn: 分配给线程的默认优先级。

source: The default value is the current working directory of the current process, usually the directory named by the system property user.dir.
zh_cn: 默认值是当前进程的当前工作目录，通常根据系统属性 user.dir 来命名。

source: The definition of this call depends on suspend(), which is deprecated.
zh_cn: 此调用的定义取决于 suspend()，它被废弃了。

source: The description of a security service.
zh_cn: 安全服务的描述。

source: The details of the representation are implementation-dependent, but the following may be regarded as typical:
zh_cn: 表示形式的细节取决于实现，但下面的情况是最常见的：

source: The different classes cover the most common usage contexts for producer-consumer, messaging, parallel tasking, and related concurrent designs.
zh_cn: 这些不同的类覆盖了生产者-使用者、消息传递、并行任务执行和相关并发设计的大多数常见使用的上下文。

source: The end argument must be greater than or equal to start, and less than or equal to the length of s.
zh_cn: end 数必须大于等于 start，且小于等于 s 的长度。

source: The exact format of the string is unspecified.
zh_cn: 字符串的确切格式没有指定。

source: The exact nature of the exception is system-dependent, but it will always be a subclass of IOException.
zh_cn: 该异常的具体本质取决于系统，但它总是 IOException 的一个子类。

source: The exception's type must be assignable either to any of the exception types declared in the throws clause of the interface method or to the unchecked exception types java.lang.RuntimeException or java.lang.Error.
zh_cn: 该异常的类型必须可以分配到在接口方法的 throws 子句中声明的任一异常类型或未经检查的异常类型 java.lang.RuntimeException 或 java.lang.Error。

source: The expected number of entries in the map and its load factor should be taken into account when setting its initial capacity, so as to minimize the number of rehash operations.
zh_cn: 在设置初始容量时应该考虑到映射中所需的条目数及其加载因子，以便最大限度地减少 rehash 操作次数。

source: The file and its description are available from the Unicode Consortium at:
zh_cn: 此文件及其描述可从 Unicode Consortium 获得，网址如下：

source: The first char value is at index 0, the next at index 1, and so on, as in array indexing.
zh_cn: 第一个 char 值在索引 0 处，第二个在索引 1 处，依此类推，这类似于数组索引。

source: The first char value of the sequence is at index zero, the next at index one, and so on, as for array indexing.
zh_cn: 对于数组索引，序列的第一个 char 值是索引零，下一个是索引一，依此类推。

source: The first character to be copied is at index srcBegin; the last character to be copied is at index srcEnd-1.
zh_cn: 要复制的第一个字符在索引 srcBegin 处；要复制的最后一个字符在索引 srcEnd-1 处。

source: The first values are:
zh_cn: 第一个值是：

source: The following code would then create a thread and start it running:
zh_cn: 然后，下列代码会创建并启动一个线程：

source: The following example uses a Class object to print the class name of an object:
zh_cn: 以下示例使用 Class 对象来显示对象的类名：

source: The following package-protected methods are designed to be overridden by LinkedHashMap, but not by any other subclass.
zh_cn: 下面的包保护方法被设计为被 LinkedHashMap 覆盖，但不被其他子类覆盖。

source: The format of this string depends on the implementation, but the following examples may be regarded as typical:
zh_cn: 此字符串的格式取决于实现，但以下示例是最常见的：

source: The frame at the top of the stack represents the execution point at which the stack trace was generated.
zh_cn: 堆栈顶部的帧表示生成堆栈跟踪的执行点。

source: The framework permits much greater flexibility in the use of locks and conditions, at the expense of more awkward syntax.
zh_cn: 该框架允许更灵活地使用锁和条件，但以更难用的语法为代价。

source: The general contract of finalize is that it is invoked if and when the JavaTM virtual machine has determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, except as a result of an action taken by the finalization of some other object or class which is ready to be finalized.
zh_cn: finalize 的常规协定是：当 JavaTM 虚拟机已确定尚未终止的任何线程无法再通过任何方法访问此对象时，将调用此方法，除非由于准备终止的其他某个对象或类的终结操作执行了某个操作。

source: The general contract of hashCode is:
zh_cn: hashCode 的常规协定是：

source: The general contract of the method run is that it may take any action whatsoever.
zh_cn: 方法 run 的常规协定是，它可能执行任何所需的动作。

source: The general intent is that, for any object x, the expression:
zh_cn: 这样做的目的是，对于任何对象 x，表达式：

source: The hash code of a member-value depends on its type:
zh_cn: 成员值的哈希码取决于其类型：

source: The hash code of a primitive value v is equal to WrapperType.valueOf(v).hashCode(), where WrapperType is the wrapper type corresponding to the primitive type of v (Byte, Character, Double, Float, Integer, Long, Short, or Boolean).
zh_cn: 基值 v 的哈希码等于 >WrapperType.valueOf(v).hashCode()，其中 WrapperType 是对应 v 的基本类型的包装器类型（Byte、Character、Double、Float、Integer、Long、Short 或 Boolean）。

source: The hash code of a string, enum, class, or annotation member-value I v is computed as by calling v.hashCode().
zh_cn: string、enum、class 或 annotation 的成员值 I 的哈希码 v 是通过调用 v.hashCode() 来计算的。

source: The hash code of an annotation is the sum of the hash codes of its members (including those with default values), as defined below: The hash code of an annotation member is (127 times the hash code of the member-name as computed by hashCode()) XOR the hash code of the member-value, as defined below:
zh_cn: 一个 annotation 的哈希码是其成员（包括那些带有默认值的成员）的哈希码的和，具体说明如下： annotation 成员的哈希码是成员值哈希码的 XOR（它是 hashCode() 计算得到的成员名哈希码的 127 倍），具体说明如下：

source: The hash code of an array member-value is computed by calling the appropriate overloading of Arrays.hashCode on the value.
zh_cn: 数组成员值的哈希码是通过基于该值调用 Arrays.hashCode 的适当重载来计算的。

source: The implementation can communicate the details of the IOException to its caller while conforming to the Collection interface by wrapping the IOException in an appropriate unchecked exception.
zh_cn: 实现可以与其调用方交流 IOException 的详细消息，同时通过以一种合适的未检查的异常来包装 IOException，使其符合 Collection 接口。

source: The implementation title, version, and vendor strings identify an implementation and are made available conveniently to enable accurate reporting of the packages involved when a problem occurs.
zh_cn: 实现标题、版本和供应商字符串共同标识了一个实现，并且可以很方便地使用它们来支持出现问题时所涉及的包的准确报告。

source: The implementation version strings have no specified syntax and should only be compared for equality with desired version identifiers.
zh_cn: 实现版本字符串没有特定的语法，并且应该只在为了使它们等同于所需的版本标识符时对它们进行比较。

source: The implementations themselves may then be written by independent third-party vendors and plugged in seamlessly as needed.
zh_cn: 实现本身可由独立的第三方厂商来写，可以根据需要进行无缝的插入。

source: The implementor must also ensure that the relation is transitive: (x.compareTo(y)>0 && y.compareTo(z)>0) implies x.compareTo(z)>0.
zh_cn: 实现类还必须确保关系是可传递的：(x.compareTo(y)>0 && y.compareTo(z)>0) 意味着 x.compareTo(z)>0。

source: The implementor must ensure sgn(x.compareTo(y)) == -sgn(y.compareTo(x)) for all x and y.
zh_cn: 实现类必须确保对于所有的 x 和 y 都存在 sgn(x.compareTo(y)) == -sgn(y.compareTo(x)) 的关系。

source: The index argument must be greater than or equal to 0, and less than the length of this sequence.
zh_cn: index 参数必须大于等于 0，且小于此序列的长度。

source: The index refers to char values (Unicode code units) and ranges from 0 to length() - 1.
zh_cn: 该索引引用 char 值（Unicode 代码单元），其范围是从 0 到 length() - 1。

source: The index refers to char values (Unicode code units) and ranges from 1 to length().
zh_cn: 该索引引用 char 值（Unicode 代码单元），其范围是从 1 到 length()。

source: The initial capacity of the string buffer is 16 plus the length of the string argument.
zh_cn: 该字符串的初始容量为 16 加上字符串参数的长度。

source: The initial capacity of the string buffer is 16 plus the length of the CharSequence argument.
zh_cn: 该字符串缓冲区的初始容量为 16 加上 CharSequence 参数的长度。

source: The initial capacity of the string builder is 16 plus the length of the string argument.
zh_cn: 该字符串生成器的初始容量为 16 加上字符串参数的长度。

source: The initial capacity of the string builder is 16 plus the length of the CharSequence argument.
zh_cn: 该字符串生成器的初始容量为 16 加上 CharSequence 参数的长度。

source: The initial value is false.
zh_cn: 初始值为 false。

source: The initial value is a copy of the environment of the current process (see getenv()).
zh_cn: 初始值是当前进程环境的一个副本（请参阅 getenv()）。

source: The integer returned is the largest value k such that:
zh_cn: 返回的整数是满足以下条件的最大 k 值：

source: The integer returned is the smallest value k such that:
zh_cn: 返回的整数是满足以下条件的最小 k 值：

source: The integer returned is the smallest value k for which:
zh_cn: 返回的整数是满足以下条件的最小 k 值：

source: The invocation handler processes the encoded method invocation as appropriate and the result that it returns will be returned as the result of the method invocation on the proxy instance.
zh_cn: 调用处理程序以适当的方式处理编码的方法调用，并且它返回的结果将作为代理实例上方法调用的结果返回。

source: The iterators returned by all of this class's "collection view methods" are fail-fast: if the map is structurally modified at any time after the iterator is created, in any way except through the iterator's own remove method, the iterator will throw a ConcurrentModificationException.
zh_cn: 由所有此类的“collection 视图方法”所返回的迭代器都是快速失败 的：在迭代器创建之后，如果从结构上对映射进行修改，除非通过迭代器本身的 remove 方法，其他任何时间任何方式的修改，迭代器都将抛出 ConcurrentModificationException。

source: The java.net package can be roughly divided in two sections:
zh_cn: java.net 包可以大致分为两个部分：

source: The java.net package provides 4 kinds of Sockets:
zh_cn: java.net 包提供 4 种套接字：

source: The kc argument caches comparableClassFor(key) upon first use comparing keys.
zh_cn: kc 参数在第一次使用比较键时缓存 comparableClassFor(key)。

source: The key whose presence in this map is to be tested
zh_cn: 要测试其是否在此映射中存在的键

source: The lack of information on the value to your application of each reference limits the usefulness of soft references.
zh_cn: 缺乏关于每个引用的应用价值的信息限制了软引用的有用性。

source: The last element of the array represents the bottom of the stack, which is the least recent method invocation in the sequence.
zh_cn: 最后一个元素代表堆栈底，是该序列中最旧的方法调用。

source: The length (in chars) of the returned sequence is end - start, so if start == end then an empty sequence is returned.
zh_cn: 返回序列的长度（char 中）是 end - start，因此，如果 start == end，则返回一个空序列。

source: The length is the number of 16-bit chars in the sequence.
zh_cn: 长度为序列中 16 位 char 数。

source: The length of the string will be the length of this sequence.
zh_cn: 字符串的长度就是此序列的长度。

source: The length of this sequence increases by 1.
zh_cn: 此序列的长度将增加 1。

source: The length of this sequence increases by Character.charCount(codePoint).
zh_cn: 此序列的长度将增加 Character.charCount(codePoint)。

source: The length of this sequence increases by len chars.
zh_cn: 此序列的长度将加 len 个 char。

source: The length of this sequence increases by the length of the argument.
zh_cn: 此字符将增加该参数的长度。

source: The length of this sequence increases by the value of len.
zh_cn: 此字符的长度增加 len。

source: The length of this sequence is increased by end - start.
zh_cn: 序列的长度将增加 end - start。

source: The length of this sequence is increased by the value of end - start.
zh_cn: 序列的长度将增加 end - start。

source: The load factor for the hash table.
zh_cn: 哈希表的加载因子。

source: The load factor used when none specified in constructor.
zh_cn: 当没有在构造函数中指定时，所使用的加载因子。

source: The lock returned by method readLock().
zh_cn: readLock() 方法返回的锁。

source: The lock returned by method writeLock().
zh_cn: writeLock() 方法返回的锁。

source: The lower (least significant) 21 bits of int are used to represent Unicode code points and the upper (most significant) 11 bits must be zero.
zh_cn: int 的 21 个低位（最低有效位）用于表示 Unicode 代码点，并且 11 个高位（最高有效位）必须为零。

source: The main implementation is ReentrantLock.
zh_cn: 主要的实现是 ReentrantLock。

source: The map will be empty after this call returns.
zh_cn: 此调用返回后，映射将为空。

source: The maximum capacity, used if a higher value is implicitly specified by either of the constructors with arguments.
zh_cn: 最大容量，如果任何一个带参数的构造函数隐式指定了更大的值，则使用该最大值。

source: The maximum priority that a thread can have.
zh_cn: 线程可以具有的最高优先级。

source: The maximum radix available for conversion to and from strings.
zh_cn: 可用于与字符串相互转换的最大基数。

source: The maximum value of a Unicode code point, constant U+10FFFF.
zh_cn: Unicode 代码点 的最大值，常量 U+10FFFF。

source: The maximum value of a Unicode high-surrogate code unit in the UTF-16 encoding, constant '\uDBFF'.
zh_cn: UTF-16 编码中的 Unicode 高代理项代码单元 的最大值，常量 '\uDBFF'。

source: The maximum value of a Unicode low-surrogate code unit in the UTF-16 encoding, constant '\uDFFF'.
zh_cn: UTF-16 编码中的 Unicode 低代理项代码单元 的最大值，常量 '\uDFFF'。

source: The maximum value of a Unicode surrogate code unit in the UTF-16 encoding, constant '\uDFFF'.
zh_cn: UTF-16 编码中的 Unicode 代理项代码单元的最大值，常量 '\uDFFF'。

source: The memory effects for accesses and updates of atomics generally follow the rules for volatiles, as stated in Chapter 17 of The Java™ Language Specification:
zh_cn: 原子访问和更新的内存效果一般遵循以下可变规则，正如 The Java™ Language Specification 17 章 中的声明：

source: The method defineClass converts an array of bytes into an instance of class Class.
zh_cn: defineClass 方法将一个 byte 数组转换为 Class 类的实例。

source: The method clone for class Object performs a specific cloning operation.
zh_cn: Object 类的 clone 方法执行特定的复制操作。

source: The method does override or implement a method declared in a supertype.
zh_cn: 该方法不覆盖或实现超类中声明的方法。

source: The method has a signature that is override-equivalent to that of any public method declared in Object.
zh_cn: 该方法有一个与 Object 中声明的任何公共方法相同的重写签名。

source: The method index of this method within its defining dex file
zh_cn: 此方法在其定义的 dex 文件中的方法索引
